export const CommodityTypeList = [
  {
    key: '全部',
    value: '',
  },
  {
    key: '周',
    value: '周',
  },
  {
    key: '月',
    value: '月',
  },
  {
    key: '季',
    value: '季',
  },
  {
    key: '半年',
    value: '半年',
  },
  {
    key: '年',
    value: '年',
  },
  {
    key: '永久',
    value: '永久',
  },
];
export const CountryList = [
  {
    country_name: '全部',
    value: '',
  },
  {
    country_name: '中、美、日、韩、台、泰',
    value: ['中国', '美国', '日本', '韩国', '台湾', '泰国'],
  },
  {
    country_name: '第二梯队',
    value: ['马来西亚', '俄罗斯', '英国', '西班牙', '德国', '沙特阿拉伯', '澳大利亚', '法国', '加拿大',
      '香港', '意大利', '新加坡', '阿联酋', '以色列', '阿根廷', '瑞士', '新西兰', '科威特', '智利', '奥地利', '荷兰', '瑞典',
      '阿曼', '比利时', '芬兰', '罗马尼亚', '波兰', '挪威', '卡塔尔', '爱尔兰', '捷克共和国', '哥斯达黎加', '巴拿马',
      '葡萄牙', '丹麦', '希腊', '澳门', '匈牙利', '斯洛伐克', '巴林', '乌拉圭', '波多黎各', '立陶宛', '克罗地亚', '拉脱维亚', '塞浦路斯',
      '斯洛文尼亚', '特立尼达和多巴哥', '爱沙尼亚', '巴哈马', '卢森堡', '毛里求斯', '马耳他', '文莱', '冰岛', '安提瓜和巴布达', '巴巴多斯',
      '阿鲁巴', '圣基茨和尼维斯', '帕劳', '塞舌尔', '格林纳达', '圣卢西亚'],
  },
  {
    country_name: '第三梯队',
    value: ['蒙古', '格鲁吉亚', '关岛', '马其顿', '波黑', '瓜德罗普岛', '开曼群岛', '留尼汪岛',
      '北马里亚纳群岛', '百慕大', '特克斯和凯科斯群岛', '刚果', '英属维尔京群岛', '美属萨摩亚',
      '维尔京群岛', '安圭拉', '斯威士兰', '列支敦士登', '墨西哥', '土耳其', '保加利亚', '黎巴嫩',
      '哈萨克斯坦', '巴西', '加蓬', '博茨瓦纳', '多米尼加共和国', '土库曼斯坦', '圣文森特和格林纳丁斯',
      '塞尔维亚', '秘鲁', '多米尼克', '哥伦比亚', '南非', '厄瓜多尔', '白俄罗斯', '伊拉克', '巴拉圭',
      '苏里南', '斐济', '纳米比亚', '牙买加', '阿尔巴尼亚', '伯利兹', '圭亚那', '危地马拉', '阿塞拜疆',
      '约旦', '阿尔及利亚', '亚美尼亚', '斯里兰卡', '萨尔瓦多', '印度尼西亚', '马绍尔群岛', '玻利维亚',
      '安哥拉', '佛得角', '突尼斯', '委内瑞拉', '摩洛哥', '摩尔多瓦', '不丹', '菲律宾', '乌克兰', '老挝',
      '埃及', '越南', '巴布亚新几内亚', '洪都拉斯', '所罗门群岛', '加纳', '尼加拉瓜', '尼日利亚', '印度',
      '肯尼亚', '孟加拉国', '津巴布韦', '科特迪瓦', '巴基斯坦', '喀麦隆', '柬埔寨', '塞内加尔', '赞比亚',
      '缅甸', '吉尔吉斯斯坦', '乌兹别克斯坦', '毛里塔尼亚', '坦桑尼亚', '尼泊尔', '马里', '贝宁', '乍得',
      '也门', '海地', '几内亚比绍', '塔吉克斯坦', '卢旺达', '冈比亚', '布基纳法索', '利比里亚', '乌干达',
      '多哥', '塞拉利昂', '尼日尔', '莫桑比克', '马达加斯加', '马拉维'],
  },
];
